# Part 4: Pandas - Creating Series and Data frames

**Pandas** is the specific Python library to work with dataframes

In Python we define Dataframes as multidimensional arrays with row and column labels that can contain heterogeneous type of data, as well as missing values

**Install required libraries**

To work with Pandas, we have to had installed Numpy previously, as it builds up from somem functions included on that library too

In [1]:
import numpy as np

In [2]:
import pandas as pd

As we saw in previous show and tell sessions, we can identify the three fundamental types of Pandas data structures: **series**, **DataFrame** and **Index**

## 4.1 Pandas series object

As in Numpy objects, a Pandas Series object is defined as a one-dimensional array. And in Pandas it includes an index

In [3]:
Seriespd = pd.Series([0.2,0.8,0.9,1.0,1.8])

In [4]:
Seriespd

0    0.2
1    0.8
2    0.9
3    1.0
4    1.8
dtype: float64

A unique feature from Pandas objects is the inclusion of an index as part of the Pandas Series

The special feature of a Pandas series is that we can access any Series element by using both the index and values attributes

Pandas Series **values** are accessed using the **values** function

In [5]:
Seriespd.values

array([0.2, 0.8, 0.9, 1. , 1.8])

Pandas Series **index** are accessed using the **index** function

In [6]:
Seriespd.index

RangeIndex(start=0, stop=5, step=1)

## 4.1.1 Pandas series indexing

We use a similiar notation as the one used in Numpy to access Pandas arrays

In [7]:
Seriespd[1]

0.8

In [8]:
Seriespd[2:4]

2    0.9
3    1.0
dtype: float64

Remember that with indexing the right part of the indexing :R always returns one element less that what the index shows

In [9]:
Seriespd[2:5]

2    0.9
3    1.0
4    1.8
dtype: float64

## 4.1.2 Pandas special indexing features

We can use different types of values in our indexes, not just numeric ones

In [10]:
Mydata = pd.Series([2,4,6,7,9,12],index=['a','b','c','d','e','f'])

In [11]:
Mydata

a     2
b     4
c     6
d     7
e     9
f    12
dtype: int64

## 4.1.3 Building Pandas Series objects

In [12]:
Buildseries = pd.Series([2,8,9,10,11])

In [13]:
Buildseries

0     2
1     8
2     9
3    10
4    11
dtype: int64

In the example above, a Numpy array is created and the index is the integer sequence starting in 0

## 4.1.4 Data Selection in Series

Indexer using loc, iloc and ix

In [14]:
newdata = pd.Series(['d','e','f'], index =[1,2,6])

In [15]:
newdata

1    d
2    e
6    f
dtype: object

In [16]:
newdata[1]

'd'

Later on we will use extensively the iloc function to slice Dataframes in coming weeks. It is a Purely integer-location based indexing for selection by position.

Check the Pandas official website on how to use the iloc function [iloc function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html)

In [17]:
newdata.iloc[0]

'd'

In [18]:
newdata.iloc[0:2]

1    d
2    e
dtype: object

## 4.2 Pandas DataFrame object

The main difference between a Series object and a DataFrame object lies the extra **row indices** and flexible **column names**  features that DataFrame object include over Series objects

In [19]:
region_pop_list = {'South East':9180135,'London':8961989,'North West':7341196,'East of England':6236072}

We transform the list above into a Pandas Series in order to later make a data frame

In [20]:
region_pop = pd.Series(region_pop_list)

In [21]:
region_pop

South East         9180135
London             8961989
North West         7341196
East of England    6236072
dtype: int64

In [22]:
covid_cases_list ={'South East':45496,'London':53804,'North West':98565,'East of England':32760}

In [23]:
covid_cases = pd.Series(covid_cases_list)

In [24]:
covid_cases

South East         45496
London             53804
North West         98565
East of England    32760
dtype: int64

We can use this dictionary to build a single two-dimensional object that will include all this information

In [25]:
England_regions = pd.DataFrame({'population':region_pop,'new_covid_cases':covid_cases})

In [26]:
England_regions

                 population  new_covid_cases
South East          9180135            45496
London              8961989            53804
North West          7341196            98565
East of England     6236072            32760

Now we can access different elements of the Dataframe using the index attribute

In [27]:
England_regions.index

Index(['South East', 'London', 'North West', 'East of England'], dtype='object')

In [28]:
England_regions.columns

Index(['population', 'new_covid_cases'], dtype='object')

## 4.2.1 We can use this dataframe to access individual elements using now column names

In [29]:
England_regions['population']

South East         9180135
London             8961989
North West         7341196
East of England    6236072
Name: population, dtype: int64

In [30]:
England_regions['new_covid_cases']

South East         45496
London             53804
North West         98565
East of England    32760
Name: new_covid_cases, dtype: int64

## 4.2.2 DataFrames as two dimensional arrays

We can view dataframes as a dimensional array like this below

In [31]:
England_regions.values

array([[9180135,   45496],
       [8961989,   53804],
       [7341196,   98565],
       [6236072,   32760]], dtype=int64)

We can introduce new data manipulations in Dataframes such as Transpose function

In [32]:
England_regions.T

                 South East   London  North West  East of England
population          9180135  8961989     7341196          6236072
new_covid_cases       45496    53804       98565            32760

We can access a single column

In [33]:
England_regions['population']

South East         9180135
London             8961989
North West         7341196
East of England    6236072
Name: population, dtype: int64

In [34]:
England_regions

                 population  new_covid_cases
South East          9180135            45496
London              8961989            53804
North West          7341196            98565
East of England     6236072            32760

When using the iloc() function in Pandas, we keep the index and column label from the dataframe

In [35]:
England_regions.iloc[:1,:1]

            population
South East     9180135

Subset population information from dataframe for two regions

In [36]:
England_regions.iloc[:2,:1]

            population
South East     9180135
London         8961989

In [37]:
England_regions.iloc[2:3,:2]

            population  new_covid_cases
North West     7341196            98565

### Important convention

When using the .iloc() function we can get a good control of the rows and cols that we subset in a dataframe

**1** Access dataset by index

In [38]:
England_regions.iloc[1:2]

        population  new_covid_cases
London     8961989            53804

## 4.3 Combine datasets using contenate and append functions

We can use pd.concat() function to concatente two datasets

In [39]:
pop_list2 = {'CityA':91801,'CityB':89619,'CityC':73411,'CityD':62360}

In [40]:
polution  ={'CityA':45496,'CityB':53804,'CityC':98565,'CityD':32760}

In [41]:
Indic01 = pd.DataFrame({'population':pop_list2,'polution':polution})

In [42]:
Indic01

       population  polution
CityA       91801     45496
CityB       89619     53804
CityC       73411     98565
CityD       62360     32760

In [43]:
pop_list3 = {'CityA':91801,'CityB':89619,'CityC':73411,'CityD':62360}

In [44]:
polution2  ={'CityA':45496,'CityB':53804,'CityC':98565,'CityD':32760}

In [45]:
Indic02 = pd.DataFrame({'population':pop_list3,'polution':polution2})

In [46]:
Indic02

       population  polution
CityA       91801     45496
CityB       89619     53804
CityC       73411     98565
CityD       62360     32760

Then we concatenate those two dataframes

In [48]:
Alldata = pd.concat([Indic01,Indic02])

In [49]:
Alldata

       population  polution
CityA       91801     45496
CityB       89619     53804
CityC       73411     98565
CityD       62360     32760
CityA       91801     45496
CityB       89619     53804
CityC       73411     98565
CityD       62360     32760

Now we can try to **apend** them using this other method

In [50]:
Alldataappend = Indic01.append(Indic02)

In [51]:
Alldataappend

       population  polution
CityA       91801     45496
CityB       89619     53804
CityC       73411     98565
CityD       62360     32760
CityA       91801     45496
CityB       89619     53804
CityC       73411     98565
CityD       62360     32760

## 4.4 Merge datasets

We use the pd.merge() function for a standard one-to-one merge in Pandas

We use pd.merge in the same way you do a join in SQL

In [52]:
df1 = pd.DataFrame({'name':['Andrew','John','Matthew'],
                   'gorup':['Accounting','Engineering','Sales']})

In [53]:
df1

      name        gorup
0   Andrew   Accounting
1     John  Engineering
2  Matthew        Sales

In [54]:
df2 = pd.DataFrame({'name':['Andrew','John','Matthew'],
                   'hire_date':[2004,2005,2012]})

In [55]:
df2

      name  hire_date
0   Andrew       2004
1     John       2005
2  Matthew       2012

In [56]:
df4 = pd.merge(df1,df2)

In [57]:
df4

      name        gorup  hire_date
0   Andrew   Accounting       2004
1     John  Engineering       2005
2  Matthew        Sales       2012

## 4.5 Pandas read_csv() function

We use read_csv() function in Pandas to import any comma delimited file into our workspace

pd.read_csv()

One of the first steps in any data science project is to import data. In Python the read_csv() function allows that

In [ ]:
passengers_df = pd.read_csv("Air_Traffic_Passenger_Statistics.csv")

In [ ]:
passengers_df.head()